In [1]:
%pylab inline
import numpy as np
import pandas as pd

Populating the interactive namespace from numpy and matplotlib

## Index
* [stack and unstack](#stack-and-unstack)

## stack and unstack
* <span style="color:orange;font-style:italic;font-weight:bold">stack</span>: DataFrame to hierchical series
* <span style="color:orange;font-style:italic;font-weight:bold">unstack</span>: hierchical series to DataFrame

In [3]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [5]:
series = data.stack()
series

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [6]:
# By default the innermost level is unstacked (as the column). You can use another level as the column by passing a level number or name
series.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [7]:
series.unstack(0) # level 0 as the column

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [8]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [13]:
df2=data2.unstack()
df2

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [14]:
# stack by default filter out NaN
df2.stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64